import pandas as pd

students={"Іваненко":[10,9,8,11,12,10,9,8,10,12],
          "Петренко":[8,7,9,10,9,8,9,7,8,9],
          "Сидоренко":[11,10,12,10,11,12,11,12,10,12],
          "Коваленко":[7,6,8,9,7,8,9,6,8,7],
          "Бондаренко":[9,9,9,10,9,10,9,10,9,9],
          "Мельник":[12,12,11,12,12,11,12,12,11,12],
          "Гриценко":[8,8,9,9,10,9,9,8,9,9],
          "Шевченко":[6,7,8,7,6,8,7,7,6,7],
          "Олійник":[9,10,9,10,11,10,9,10,10,10],
          "Романенко":[11,11,10,12,11,11,12,12,10,11]}

df=pd.DataFrame(students)
df['Предмет']=['Математика','Фізика','Хімія','Біологія','Інформатика',
               'Географія','Історія','Література','Мистецтво','Фізкультура']

print("DataFrame:")
print(df)
print("\nПерші 3 рядки:")
print(df.head( 3))
print("\nТипи даних:")
print(df.dtypes)
print("\nРозмір:")
print(df.shape)
print("\nОписова статистика")
print(df.describe())
marks_cols = ["Іваненко","Петренко","Сидоренко","Коваленко","Бондаренко",
              "Мельник","Гриценко","Шевченко","Олійник","Романенко"]
df['Середній_бал']=df[marks_cols].mean(axis=1)
high_scores=df[df['Середній_бал']>9.5]
print("\nПредмети з середнім балом більше 9.5")
print(high_scores)
sorted_df=df.sort_values(by='Середній_бал',ascending=False)
print("\nВідсортовані за спаданням середнього балу")
print(sorted_df)
grouped=df.groupby('Предмет')['Середній_бал'].mean()
print("\nСередній бал за предметом")
print(grouped)
max_score=df['Середній_бал'].max()
print("\nМаксимальний середній бал:",max_score)
unique_subjects=df['Предмет'].nunique()
print("Кількість унікальних предметів:",unique_subjects)